lib/tasks/news.rake

  task latest: :environment do
    articles = Article.order(published_at: :desc).limit(10)

    if articles.any?
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."published_at" DESC LIMIT 10
SELECT 1 AS one FROM "articles" LIMIT 1