app/services/news_fetchers/base_fetcher.rb

SELECT "articles".* FROM "articles" WHERE "articles"."external_id" = '1nbqt4d' AND "articles"."source_type" = 'reddit' LIMIT 1
---
  def create_or_update_article(attributes)
    article = Article.find_or_initialize_by(
      external_id: attributes[:external_id],
      source_type: attributes[:source_type]
    )