app/controllers/articles_controller.rb

  def show
    @article = Article.includes(:bookmark, :read_article, :dismissed_article).find(params[:id])
    @similar_articles = Article.similar_to(@article).includes(:bookmark, :read_article, :dismissed_article)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."article_id" = $1 LIMIT $2  [["article_id", 152051966], ["LIMIT", 1]]
SELECT MAX("articles"."updated_at") FROM "articles"