app/controllers/articles_controller.rb

  def index
    @show_read = params[:show_read] == 'true'

    @articles = if @show_read
                  Article.order(published_at: :desc)
                else
                  Article.not_read.order(published_at: :desc)
                end.limit(50)

    @articles_by_source = @articles.group_by(&:source_type)
    @articles_by_category = view_context.group_sources_by_category(@articles_by_source)
    @total_count = @show_read ? Article.count : Article.not_read.count
---
SELECT "read_articles".* FROM "read_articles" WHERE "read_articles"."article_id" = $1 LIMIT $2  [["article_id", 403654315], ["LIMIT", 1]]
SELECT MAX("articles"."updated_at") FROM "articles"

  def bookmark
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 999999], ["LIMIT", 1]]

  def unbookmark
    @article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT $2  [["id", 152051966], ["LIMIT", 1]]