app/controllers/bookmarks_controller.rb

  def index
    page, per_page = pagination_params

    @bookmarked_articles = Article.bookmarked
                                 .includes(:bookmark)
                                 .order("bookmarks.bookmarked_at DESC")
                                 .limit(per_page)
                                 .offset((page - 1) * per_page)
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."article_id" = $1 LIMIT $2  [["article_id", 902727586], ["LIMIT", 1]]
SELECT "read_articles".* FROM "read_articles" WHERE "read_articles"."article_id" = $1 LIMIT $2  [["article_id", 902727586], ["LIMIT", 1]]
SELECT COUNT(DISTINCT "articles"."id") FROM "articles" INNER JOIN "bookmarks" ON "bookmarks"."article_id" = "articles"."id"