app/controllers/read_articles_controller.rb

SELECT "read_articles".* FROM "read_articles" WHERE "read_articles"."article_id" = $1 LIMIT $2  [["article_id", 902727586], ["LIMIT", 1]]
SELECT MAX("articles"."updated_at") FROM "articles"
---
  def index
    page = params[:page]&.to_i || 1
    per_page = params[:per_page]&.to_i || 50
    per_page = [ per_page, 100 ].min

    @read_articles = Article.read
                           .includes(:read_article)
                           .order("read_articles.read_at DESC")
                           .limit(per_page)
                           .offset((page - 1) * per_page)