app/models/article.rb

  scope :not_bookmarked, -> { left_joins(:bookmark).where(bookmarks: { id: nil }) }
---
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."article_id" = 220 LIMIT 1

  def unbookmark!
    if bookmark
      bookmark.destroy
---
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = 2